In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    "name" : ["harry", "rohan", "skillf", "shubham"],
    'marks': [92, 34, 24, 17],
    'city': ['rampur', 'kolkata', 'bareilly', 'antarctica']
}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

      name  marks        city
0    harry     92      rampur
1    rohan     34     kolkata
2   skillf     24    bareilly
3  shubham     17  antarctica

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index = False)

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

      name  marks        city
2   skillf     24    bareilly
3  shubham     17  antarctica

In [9]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
df.to_csv('chandan.csv', index = False)

In [11]:
chandan = pd.read_csv('chandan.csv')

In [12]:
chandan

      name  marks        city
0    harry     92      rampur
1    rohan     34     kolkata
2   skillf     24    bareilly
3  shubham     17  antarctica

In [13]:
chandan = pd.read_csv('chandan.csv')

In [14]:
chandan

      name  marks        city
0    harry     92      rampur
1    rohan     34     kolkata
2   skillf     24    bareilly
3  shubham     17  antarctica

In [15]:
chandan['name']

0      harry
1      rohan
2     skillf
3    shubham
Name: name, dtype: object

In [16]:
chandan['name'][0]

'harry'

In [17]:
chandan['name'][0] = 50

C:\Users\mecha\AppData\Local\Temp/ipykernel_7196/1212293308.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  chandan['name'][0] = 50

In [18]:
chandan['name'][0]

50

In [19]:
chandan

      name  marks        city
0       50     92      rampur
1    rohan     34     kolkata
2   skillf     24    bareilly
3  shubham     17  antarctica

In [20]:
chandan.to_csv('chandan1.csv')

PermissionError: [Errno 13] Permission denied: 'chandan1.csv'

In [ ]:
chandan.to_csv('chandan.csv')

In [ ]:
chandan.index = ['first', 'second', 'third', 'fourth']

In [ ]:
chandan

In [ ]:
ser = pd.Series(np.random.rand(34))

In [ ]:
type(ser)

In [ ]:
newdf= pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [ ]:
newdf.head()

In [ ]:
newdf

In [ ]:
type(newdf)

In [ ]:
newdf.describe()

In [ ]:
newdf[0][0]  = 'harry'

In [ ]:
newdf.dtypes

In [ ]:
newdf.head()

In [ ]:
newdf.index

In [ ]:
newdf.columns

In [ ]:
newdf.to_numpy()

In [ ]:
newdf[0][0] = 0.3

In [ ]:
newdf.head()

In [ ]:
newdf.to_numpy()

In [ ]:
newdf.dtypes

In [ ]:
newdf.T

In [ ]:
newdf.T

In [ ]:
newdf.head()

In [ ]:
newdf.sort_index(axis = 1, ascending =False)

In [ ]:
newdf.head()

In [ ]:
newdf[0]

In [ ]:
type(newdf[0])

In [ ]:
newdf.head()

In [ ]:
newdf2 = newdf.copy()

In [ ]:
newdf2[0][0] = 97835

In [ ]:
newdf

In [ ]:
newdf.loc[0,0] = 654

In [ ]:
newdf

In [ ]:
newdf.columns = list("ABCDE")

In [ ]:
newdf

In [ ]:
newdf.head(2)

In [ ]:
newdf.loc[0,0] = 654

In [ ]:
newdf.loc[0,'A'] = 65445

In [ ]:
newdf.head()

In [ ]:
newdf.drop(0, axis=1)

In [ ]:
newdf = newdf.drop(0, axis=1)

In [ ]:
newdf

In [ ]:
newdf.head()

In [ ]:
newdf.loc[[1,2],['C', 'D']]

In [ ]:
newdf.loc[[1,2],:]

In [ ]:
newdf.loc[:,['C', 'D']]

In [ ]:
newdf.loc[(newdf['A']< 0.3)]

In [ ]:
newdf.loc[(newdf['A']< 0.3) & (newdf['C'] >0.1)]

In [ ]:
newdf.head(2)

In [ ]:
newdf.iloc[0, 4]

In [ ]:
newdf.iloc[[0,1],[1,2]]

In [ ]:
newdf.head(3)

In [ ]:
newdf.drop(0)

In [ ]:
newdf.drop(['A', 'C'], axis =1)

In [ ]:
newdf.drop(['A', 'D'] ,axis =1, inplace=True)

In [ ]:
newdf

In [ ]:
newdf.drop([1,5], axis=0, inplace=True)

In [ ]:
newdf

In [ ]:
newdf.head(3)

In [ ]:
newdf.reset_index(drop=True, inplace = True)

In [ ]:
newdf.head(3)

In [ ]:
newdf['B'].isnull()

In [ ]:
newdf.loc[:, ['B']] = 55

In [ ]:
newdf['B'].isnull()

In [ ]:
newdf.head()

In [ ]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, np.nan, np.nan],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [ ]:
df.head()

In [ ]:
df.dropna(how = 'all',axis=1)

In [ ]:
df.head()

In [ ]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [ ]:
df.drop_duplicates(subset=['name'], keep='last')

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df['toy'].value_counts(dropna =False)

In [ ]:
df.notnull()

In [ ]:
 data = pd.read_excel('book1.xlsx')